Revit 2027 API
BuiltInFailures.SiteFailures.EnterValueOrFormula Property
 Enter a value or a formula starting with '='.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId EnterValueOrFormula { get; }
Public Shared ReadOnly Property EnterValueOrFormula As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ EnterValueOrFormula {
	FailureDefinitionId^ get ();
}
static member EnterValueOrFormula : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace